computer_vision.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-02 Tue 08:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yiping Deng" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbadc793">1. Presentation</a>
<ul>
<li><a href="#org0f0018d">1.1. Logistics:</a></li>
<li><a href="#org1586010">1.2. Grading</a></li>
<li><a href="#org4d6c91a">1.3. Work</a></li>
<li><a href="#org127a231">1.4. Health excuses</a></li>
</ul>
</li>
<li><a href="#org49fc7b9">2. Introduction to Computer Vision</a>
<ul>
<li><a href="#orgaec9581">2.1. what is vision?</a></li>
<li><a href="#org4ef4979">2.2. what information to extract?</a></li>
<li><a href="#org86e74bd">2.3. what is color?</a></li>
<li><a href="#org60f5aa7">2.4. two types of light sensitive receptors</a></li>
<li><a href="#orgeda1ff5">2.5. trichromacy</a></li>
<li><a href="#org15f6a1c">2.6. RGB v. HSV</a></li>
<li><a href="#org82e2714">2.7. white balance:</a>
<ul>
<li><a href="#org1f37ecd">2.7.1. Film cameras:</a></li>
<li><a href="#org9062d53">2.7.2. digital cmeras</a></li>
<li><a href="#orgb30b047">2.7.3. Von Kries adaptation</a></li>
<li><a href="#org15ac79f">2.7.4. Best way: gray card</a></li>
<li><a href="#org6f6387d">2.7.5. Brightest pixel assumption (non-saturated)</a></li>
<li><a href="#org7d649d2">2.7.6. Gamut mapping</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org77487fe">3. Scale-invariant</a></li>
<li><a href="#org0607f06">4. Detectors</a>
<ul>
<li><a href="#org7abb29e">4.1. Harris detector</a>
<ul>
<li><a href="#org3bd302b">4.1.1. mathematics</a></li>
<li><a href="#org2ea2b90">4.1.2. cornerness</a></li>
</ul>
</li>
<li><a href="#org5ff1319">4.2. </a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbadc793" class="outline-2">
<h2 id="orgbadc793"><span class="section-number-2">1</span> Presentation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0f0018d" class="outline-3">
<h3 id="org0f0018d"><span class="section-number-3">1.1</span> Logistics:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Tuesday 8:15 - 9:30
Friday 9:45 - 11:00
</p>
</div>
</div>
<div id="outline-container-org1586010" class="outline-3">
<h3 id="org1586010"><span class="section-number-3">1.2</span> Grading</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Homework 60%</li>
<li>Final exam 20%</li>
<li>Midterm exam 20%</li>
</ul>
</div>
</div>
<div id="outline-container-org4d6c91a" class="outline-3">
<h3 id="org4d6c91a"><span class="section-number-3">1.3</span> Work</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Regular quizzes</li>
<li>Homework/ project -&gt; pre-requisite to take the final exam
<ul class="org-ul">
<li>won't accept any homework if it is late.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org127a231" class="outline-3">
<h3 id="org127a231"><span class="section-number-3">1.4</span> Health excuses</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Not accepting health excuses.
</p>
</div>
</div>
</div>
<div id="outline-container-org49fc7b9" class="outline-2">
<h2 id="org49fc7b9"><span class="section-number-2">2</span> Introduction to Computer Vision</h2>
<div class="outline-text-2" id="text-2">
<p>
The goal of computer vision to bridging the gap between pixels and meaning.
</p>
</div>
<div id="outline-container-orgaec9581" class="outline-3">
<h3 id="orgaec9581"><span class="section-number-3">2.1</span> what is vision?</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>humans: -&gt; images -&gt; sensing devices -&gt; iterpreting device -&gt; interpretations</li>
<li>computers: -&gt; images -&gt; cameras -&gt; computers -&gt; interpretation</li>
</ul>
</div>
</div>
<div id="outline-container-org4ef4979" class="outline-3">
<h3 id="org4ef4979"><span class="section-number-3">2.2</span> what information to extract?</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Metric 3D information</li>
<li>Semantics</li>
</ul>
</div>
</div>
<div id="outline-container-org86e74bd" class="outline-3">
<h3 id="org86e74bd"><span class="section-number-3">2.3</span> what is color?</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>the result of ityeraction between physical light in the environment and our visual system.</li>
<li>A psychological property of our visual experiences when we look at objects and lights, not a physical property of those objects or lights.</li>
</ul>
</div>
</div>
<div id="outline-container-org60f5aa7" class="outline-3">
<h3 id="org60f5aa7"><span class="section-number-3">2.4</span> two types of light sensitive receptors</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>cones: cone-shaped, less sensitive, operate in high light, color vision</li>
<li>Rods: rod-shaped, highly snesitive, operate at night, gray-scala vision</li>
</ul>
</div>
</div>
<div id="outline-container-orgeda1ff5" class="outline-3">
<h3 id="orgeda1ff5"><span class="section-number-3">2.5</span> trichromacy</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>three numbers seem to be sufficient for encoding color</li>
<li>dates back to 18th centuary.</li>
<li>don't have to be always RGB</li>
</ul>
</div>
</div>
<div id="outline-container-org15f6a1c" class="outline-3">
<h3 id="org15f6a1c"><span class="section-number-3">2.6</span> RGB v. HSV</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>RGB: component</li>
<li>HSV: hue, saturation, value</li>
</ul>
</div>
</div>
<div id="outline-container-org82e2714" class="outline-3">
<h3 id="org82e2714"><span class="section-number-3">2.7</span> white balance:</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>it is the process of removing unrealistic color casts, so that objects which appear white in person are rendered white in you photo.</li>
<li>whne the white balance is not correct, the picture will have n unnatural color "cast".</li>
</ul>
</div>
<div id="outline-container-org1f37ecd" class="outline-4">
<h4 id="org1f37ecd"><span class="section-number-4">2.7.1</span> Film cameras:</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
different types of film or different filteres for different illumination condition
</p>
</div>
</div>
<div id="outline-container-org9062d53" class="outline-4">
<h4 id="org9062d53"><span class="section-number-4">2.7.2</span> digital cmeras</h4>
<div class="outline-text-4" id="text-2-7-2">
<ul class="org-ul">
<li>automatic white balance</li>
<li>custom white balancing using a reference objects</li>
</ul>
</div>
</div>
<div id="outline-container-orgb30b047" class="outline-4">
<h4 id="orgb30b047"><span class="section-number-4">2.7.3</span> Von Kries adaptation</h4>
<div class="outline-text-4" id="text-2-7-3">
<ul class="org-ul">
<li>multiply each channel by a gain factor</li>
<li>A more general approach would correspond to an arbitrary 3x3 matrix</li>
</ul>
</div>
</div>
<div id="outline-container-org15ac79f" class="outline-4">
<h4 id="org15ac79f"><span class="section-number-4">2.7.4</span> Best way: gray card</h4>
<div class="outline-text-4" id="text-2-7-4">
<ul class="org-ul">
<li>take a pciture of a neutral object (gray/white)</li>
<li>deduct the weight of each channel, use the inverse of the weight to calibrate each channel.</li>
<li>without gray card, we need to guess
<ul class="org-ul">
<li>using the average of the image, assume it is gray</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6f6387d" class="outline-4">
<h4 id="org6f6387d"><span class="section-number-4">2.7.5</span> Brightest pixel assumption (non-saturated)</h4>
<div class="outline-text-4" id="text-2-7-5">
<ul class="org-ul">
<li>highlights usually have the color of the light source</li>
<li>Use weights inversely proportional to the values of the pixel</li>
</ul>
</div>
</div>
<div id="outline-container-org7d649d2" class="outline-4">
<h4 id="org7d649d2"><span class="section-number-4">2.7.6</span> Gamut mapping</h4>
</div>
</div>
</div>
<div id="outline-container-org77487fe" class="outline-2">
<h2 id="org77487fe"><span class="section-number-2">3</span> Scale-invariant</h2>
</div>
<div id="outline-container-org0607f06" class="outline-2">
<h2 id="org0607f06"><span class="section-number-2">4</span> Detectors</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7abb29e" class="outline-3">
<h3 id="org7abb29e"><span class="section-number-3">4.1</span> Harris detector</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org3bd302b" class="outline-4">
<h4 id="org3bd302b"><span class="section-number-4">4.1.1</span> mathematics</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
\[ E(u, v) = \sum_{x, y} w(x, y) [I(x + u, y + v) - I(x, y)]\]
This equation is computational expensive, so we can use the first order Taylor
</p>
\begin{align*}
&\sum_{x, y} [I(x + u, y + v) - I(x, y)] \\
&= \sum_{x, y} [I(x,v) + u I_x + v I_y - I(x, y)] \\
&= u^2 I_x^2  2 u v I_x I_y + v^2 I_y^2 \\
&= [u v] (\sum \begin{bmatrix} I_x^2 & I_x I_y \\ I_x I_y & I_y^2 \end{bmatrix}) [u v]'
\end{align*}

<p>
Thus, we can have a bilinear approximation
\[ M = (\sum w(x,y) \begin{bmatrix} I_x^2 & I_x I_y \\ I_x I_y & I_y^2 \end{bmatrix})  \]
and 
\[ E(u, v) \approx [u, v] M [u, v]' \]
</p>
</div>
</div>
<div id="outline-container-org2ea2b90" class="outline-4">
<h4 id="org2ea2b90"><span class="section-number-4">4.1.2</span> cornerness</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
We look at the two eigen value of the \(M\) matrix. With two big eigenvalues,
it means it is a corner. If one is significantly bigger than the other, it is
a edge. If both small, it is plain images.
We write
\[ R = det(M) - k \cdot tr(M)^2 \], where \(det(M) = \lambda_1 \lambda_2\),
\(tr(M) = \lamda_1 + \lambda_2\)
</p>
</div>
</div>
</div>
<div id="outline-container-org5ff1319" class="outline-3">
<h3 id="org5ff1319"><span class="section-number-3">4.2</span> </h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yiping Deng</p>
<p class="date">Created: 2018-10-02 Tue 08:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
